#include <bits/stdc++.h>

/*
写一下题意

元组 (l, d, k, c, A, B)
表示从时刻 l 开始发 k 班车, 发车间隔 d, 从 A 到 B, 运行时间 c  

求每个站到 N 的最晚时间  

肯定不是传统意义上的分层最长路什么的, 不然 O(NM) 了  
我感觉是 dagdp  

f(n) = +inf
然后对其每个入边, 起点是有到达 n 的最晚出发时间的, 也就是要找出 max{s + c} 的, 
也就是我一边要用 dp 找最长路一边确定能出现的边吗?  

每个元组描述一定是只能存在常数条边的, 不然复杂度爆炸, 一定有一种规则可以过滤掉大多数没什么用的边  
呃, 因为要结合 s(出发时间) 和 c(行驶时间), 求 s + c 一定是构成一个前沿而不是一个点, 虽然有些边能被支配就能完全去掉, 
我们现在只考虑这个前沿, 

假设这个点的下一个点的出边有这样的 (出发时间, 到达时间) = (1, 5), (2, 4)
那我这个点只能选两种边, 在 1 之前的, 最优; 在 1 2 之间的, 次优, 这样甚至可以得到每条边的 f(n), 一个点的 f(n) 就是它所有出边的 f(n) 求 max
吗?

从 n 开始往回走, 遍历 adj 以及 adj -> n, 确立

呃好像不行, 似乎会使一条边出现 m 条边, 不合适, 比如你下一个集合有 3 条前沿边, 然后这个点只有一个元组描述, 
但是分别都能接上下个集合的三条比, 那就得变成三条边, 这样就增长了倍数级别的复杂度, 不合理  

不知道了, 感觉很复杂  

================================================================

更新一下, 看错题目了, f(s) 是最晚出发时间而不是最晚到达时间  
那么转移为
对于入边 e, 实际上可以转移 
if f(s) - e.c - e.l < 0
    ret -inf
lower = (f(s) - e.c - e.l) / e.d * e.d + e.l;
upper = e.l + (e.k - 1)e.d
ret min(lower, upper)

但是可能存在环, 所以并不能进行 dagdp, 但是对于一个点 p 来说, 每条出边的结果都是取 max, 符合单调性, 因此可以 dij

f(p) = -inf 初始化, f(n) = +inf  
*/

int main()
{
    std::cin.tie(nullptr);
    std::ios::sync_with_stdio(false);


}